espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/kit/common/drivers/emwin/DK3550/ssd2119.c
/***************************************************************************//**
 * @file
 * @brief SSD2119 LCD controller driver
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if (!defined(WIN32) || defined(LCD_SIMCONTROLLER))

/*********************************************************************
 *
 *       Include common code
 *
 **********************************************************************
 */

#include <stddef.h>
#include <string.h>
#include "em_types.h"
//#include "LCD_Private.h"
#include "GUI_Private.h"
//#include "LCD_SIM.h"
//#include "LCD_ConfDefaults.h"

#include "dmd/ssd2119/dmd_ssd2119_registers.h"
#include "ssd2119.h"

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */
/*********************************************************************
 *
 *       Static functions
 *
 **********************************************************************
 */

typedef struct {
  uint32_t VRAMAddr;
  uint32_t BaseAddr;
  volatile uint16_t *commandAddr;
  volatile uint16_t *dataAddr;
  int BufferIndex;
  int xSize, ySize;
  int vxSize, vySize;
  int vxSizePhys;
  int xPos, yPos;
  int Alpha;
  int IsVisible;
  void (* pfFillRect)(int LayerIndex, int x0, int y0, int x1, int y1, uint32_t PixelIndex);   void (* pfCopyBuffer)(int LayerIndex, int IndexSrc, int IndexDst);
  void (* pfDrawBMP1)(int LayerIndex, int x, int y, uint8_t const * p, int Diff, int xSize, int ySize, int BytesPerLine, const LCD_PIXELINDEX * pTrans);
  void (* pfCopyRect)(int LayerIndex, int x0, int y0, int x1, int y1, int xSize, int ySize);
#ifdef SSD2119_REGISTER_ACCESS_HOOKS
  void (* pfWriteRegister)(uint16_t reg);
  uint16_t (* pfReadRegister)(uint16_t reg);
  void (* pfWriteData)(uint16_t value);
  uint16_t (* pfReadData)(void);
#endif
  void (* pfInitialize)(GUI_DEVICE * pDevice);
} DRIVER_CONTEXT;

#ifdef SSD2119_REGISTER_ACCESS_HOOKS
  #define SET_REGISTER(context, reg) (context)->pfWriteRegister(reg)
  #define WRITE_REGISTER(context, reg, val) (context)->pfWriteRegister(reg); (context)->pfWriteData(val)
  #define READ_REGISTER(context, reg) (context)->pfReadRegister(reg)
  #define WRITE_DATA(context, val) (context)->pfWriteData(val)
  #define READ_DATA(context) (context)->pfReadData()
#else
  #define SET_REGISTER(context, reg) *((context)->commandAddr) = (reg)
  #define WRITE_REGISTER(context, reg, val) *((context)->commandAddr) = (reg); *((context)->dataAddr) = (val)
  #define READ_REGISTER(context, reg) *((context)->commandAddr) = (reg); *((context)->dataAddr)
  #define WRITE_DATA(context, val) *((context)->dataAddr) = (val)
  #define READ_DATA(context) *((context)->dataAddr)
#endif

DRIVER_CONTEXT *current_context;

#ifdef SSD2119_REGISTER_ACCESS_HOOKS
static void SSD2119_WriteRegister(uint16_t reg)
{
  *current_context->commandAddr = reg;
  return;
}

static uint16_t SSD2119_ReadRegister(uint16_t reg)
{
  *current_context->commandAddr = reg;
  return *current_context->dataAddr;
}

static void SSD2119_WriteData(uint16_t val)
{
  *current_context->dataAddr = val;
}

static uint16_t SSD2119_ReadData(void)
{
  return *current_context->dataAddr;
}
#endif

inline static void SSD2119_SetCurrentPosition(DRIVER_CONTEXT *context, int x, int y)
{
  /* Set pixel position */
  WRITE_REGISTER(context, DMD_SSD2119_SET_X_ADDRESS_COUNTER, x);
  WRITE_REGISTER(context, DMD_SSD2119_SET_Y_ADDRESS_COUNTER, y);
}

inline static void SSD2119_PrepareDataAccess(DRIVER_CONTEXT *context)
{
  SET_REGISTER(context, DMD_SSD2119_ACCESS_DATA);
}

static void SSD2119_SetClippingArea(DRIVER_CONTEXT *context, int x0, int y0, int x1, int y1)
{
  uint16_t vClip;

  /* Set the clipping region in the display */
  WRITE_REGISTER(context, DMD_SSD2119_HORIZONTAL_RAM_ADDRESS_START_POS, x0);
  WRITE_REGISTER(context, DMD_SSD2119_HORIZONTAL_RAM_ADDRESS_END_POS, x1);

  vClip  = y1 << DMD_SSD2119_VERTICAL_RAM_ADDRESS_POS_END_SHIFT;
  vClip |= y0 << DMD_SSD2119_VERTICAL_RAM_ADDRESS_POS_START_SHIFT;
  WRITE_REGISTER(context, DMD_SSD2119_VERTICAL_RAM_ADDRESS_POS, vClip);
}
/** @endcond */

/**************************************************************************//**
*  @brief
*  Initializes the LCD display
*
*  @param pDevice GUI_DEVICE pointer.
******************************************************************************/
void SSD2119_Initialize(GUI_DEVICE * pDevice)
{
  uint16_t data;
  DRIVER_CONTEXT *context = (DRIVER_CONTEXT *)pDevice->u.pContext;

  /* Initialize register cache variables */
  //rcDriverOutputControl = 0;

  /* Initialization sequence, see UMSH-8252MD-T page 13 */

  /*  printf("R%x: 0x%x\n", DMD_SSD2119_VCOM_OTP_1, 0x0006); */
  WRITE_REGISTER(context, DMD_SSD2119_VCOM_OTP_1, 0x0006);

  /* Start oscillation */
  data = DMD_SSD2119_OSCILLATION_START_OSCEN;
  /*  printf("R%x: 0x%x\n", DMD_SSD2119_OSCILLATION_START, data); */
  WRITE_REGISTER(context, DMD_SSD2119_OSCILLATION_START, data);

  /* Exit sleep mode */
  data = 0;
  /*  printf("R%x: 0x%x\n", DMD_SSD2119_SLEEP_MODE_1, data); */
  WRITE_REGISTER(context, DMD_SSD2119_SLEEP_MODE_1, data);

