espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/kit/common/drivers/emwin/DK3550/ssd2119.c
  PixelIndex = SSD2119_GetPixelIndex(pDevice, x, y);
  IndexMask  = pDevice->pColorConvAPI->pfGetIndexMask();
  SSD2119_SetPixelIndex(pDevice, x, y, PixelIndex ^ IndexMask);
}

/**************************************************************************//**
 * @brief
 *   Fill specified rectangle with current colour index
 * @details
 *   This function fills rectangle with its corner positions specified by
 *   arguments (x0, y0) and (x1, y1). To fill the rectangle current colour is
 *   used. As a side effect, function changes clipping area to entire display.
 *   Argument pDevice is present for compability with other display drivers.
 *****************************************************************************/
static void SSD2119_FillRect(GUI_DEVICE * pDevice, int x0, int y0, int x1, int y1)
{
  uint16_t PixelIndex;
  DRIVER_CONTEXT *context = (DRIVER_CONTEXT *)pDevice->u.pContext;

  int size;
  int xl, xh, yl, yh;
  if (x0 < x1) {
    xl = x0;
    xh = x1;
  } else {
    xl = x1;
    xh = x0;
  }
  if (y0 < y1) {
    yl = y0;
    yh = y1;
  } else {
    yl = y1;
    yh = y0;
  }
  switch (GUI_GetDrawMode() & LCD_DRAWMODE_XOR) {
    case 0:
      size = (xh - xl + 1) * (yh - yl + 1);
      SSD2119_SetClippingArea(context, x0, y0, x1, y1);
      SSD2119_SetCurrentPosition(context, xl, yl);
      PixelIndex = LCD__GetColorIndex();
      SSD2119_PrepareDataAccess(context);
      while (size--)
        WRITE_DATA(context, PixelIndex);
      SSD2119_SetClippingArea(context, 0, 0, context->xSize, context->ySize);
      break;
    case LCD_DRAWMODE_XOR:
      for (x0 = xl; x0 <= xh; x0++) {
        for (y0 = yl; y0 <= yh; y0++) {
          SSD2119_XorPixel(pDevice, x0, y0);
        }
      }
      break;
  }
}

/**************************************************************************//**
 * @brief
 *   draw horizontal line using current colour
 * @details
 *   This function draws horizontal line with using current colour.
 *   To achieve this functionality SSD2119_FillRect function is executed, so as a side
 *   effect, function changes clipping area to entire display.
 *   Argument pDevice is present for compability with other display drivers.
 *****************************************************************************/
static void SSD2119_DrawHLine(GUI_DEVICE * pDevice, int x0, int y, int x1)
{
  SSD2119_FillRect(pDevice, x0, y, x1, y);
}

/**************************************************************************//**
 * @brief
 *   draw vertical line using current colour
 * @details
 *   This function draws vertical line with using current colour.
 *   To achieve this functionality SSD2119_FillRect function is executed, so as a side
 *   effect, function changes clipping area to entire display.
 *   Argument pDevice is present for compability with other display drivers.
 *****************************************************************************/
static void SSD2119_DrawVLine(GUI_DEVICE * pDevice, int x, int y0, int y1)
{
  SSD2119_FillRect(pDevice, x, y0, x, y1);
}
/**************************************************************************//**
 * @brief
 *   draw one line of bitmap encoded in 1 bit per pixel
 * @details
 *   This function draws one line of 1BPP encoded bitmap. It is internally used
 *   by drawing entire bitmap routine. Depending on currend drawing mode the
 *   line could be simple setting pixels and background, setting only pixels
 *   with adequate bits set or inverting pixels when adequate bits set.
 *   Argument pDevice is present for compability with other display drivers.
 *****************************************************************************/
static void SSD2119_HorizontalLine1bpp(GUI_DEVICE * pDevice, unsigned x, unsigned y, uint8_t const GUI_UNI_PTR * p, int Diff, int xsize, const LCD_PIXELINDEX * pTrans)
{
  unsigned Pixels, PixelCnt, invalidPosition = 1;
  LCD_PIXELINDEX Index, Index0, Index1, IndexMask;
  unsigned i, NumLoops;

  Index0   = *(pTrans + 0);
  Index1   = *(pTrans + 1);
  x       += Diff;
  PixelCnt = 8 - Diff;
  Pixels   = LCD_aMirror[*p] >> Diff;

  switch (GUI_GetDrawMode() & (LCD_DRAWMODE_TRANS | LCD_DRAWMODE_XOR)) {
    case 0:
      SSD2119_SetCurrentPosition((DRIVER_CONTEXT *)pDevice->u.pContext, x, y);
      SSD2119_PrepareDataAccess((DRIVER_CONTEXT *)pDevice->u.pContext);
      do {
        NumLoops = GUI_MIN(PixelCnt, (unsigned)xsize);
        i = NumLoops;
        do {
          Index = (Pixels & 1) ? Index1 : Index0;
          WRITE_DATA((DRIVER_CONTEXT *)pDevice->u.pContext, Index);
          Pixels >>= 1;
        } while (--i);
        PixelCnt -= NumLoops;
        xsize -= NumLoops;
        if (PixelCnt == 0) {
          Pixels   = LCD_aMirror[*(++p)];
          PixelCnt = 8;
        }
      } while (xsize);
      break;
    case LCD_DRAWMODE_TRANS:
      do {
        if (Pixels & 1) {
          if (invalidPosition) {
            SSD2119_SetCurrentPosition((DRIVER_CONTEXT *)pDevice->u.pContext, x, y);
            SSD2119_PrepareDataAccess((DRIVER_CONTEXT *)pDevice->u.pContext);
            invalidPosition = 0;
          }
          WRITE_DATA((DRIVER_CONTEXT *)pDevice->u.pContext, Index1);
        } else {
          invalidPosition = 1;
        }
        x++;
        PixelCnt--;
        Pixels >>= 1;
        if (PixelCnt == 0) {
          Pixels   = LCD_aMirror[*(++p)];
          PixelCnt = 8;
        }
      } while (--xsize);
      break;
    case LCD_DRAWMODE_XOR | LCD_DRAWMODE_TRANS:
    case LCD_DRAWMODE_XOR:
      IndexMask = pDevice->pColorConvAPI->pfGetIndexMask();
      do {
        SSD2119_SetCurrentPosition((DRIVER_CONTEXT *)pDevice->u.pContext, x, y);
        SSD2119_PrepareDataAccess((DRIVER_CONTEXT *)pDevice->u.pContext);
        /* dummy read required by LCD controller */
        Index = READ_DATA((DRIVER_CONTEXT *)pDevice->u.pContext);
        Index = READ_DATA((DRIVER_CONTEXT *)pDevice->u.pContext);
        if (Pixels & 1) {
          Index ^= IndexMask;
        }
        WRITE_DATA((DRIVER_CONTEXT *)pDevice->u.pContext, Index);
        x++;
        PixelCnt--;
        Pixels >>= 1;
        if (PixelCnt == 0) {
          Pixels   = LCD_aMirror[*(++p)];
          PixelCnt = 8;
        }
      } while (--xsize);
      break;
  }
}

/**************************************************************************//**
 * @brief
 *   draw one line of bitmap encoded in 2 bits per pixel
 * @details
 *   This function draws one line of 2BPP encoded bitmap. It is internally used
 *   by drawing entire bitmap routine. Depending on currend drawing mode the
 *   line could be simple setting pixels and background or setting only pixels
 *   with adequate bits set.
 *   Argument pDevice is present for compability with other display drivers.
 *****************************************************************************/
static void  SSD2119_HorizontalLine2bpp(GUI_DEVICE * pDevice, int x, int y, uint8_t const GUI_UNI_PTR * p, int Diff, int xsize, const LCD_PIXELINDEX * pTrans)
{
  LCD_PIXELINDEX Pixels, PixelIndex;
  int CurrentPixel, Shift, Index;
  Pixels       = *p;
  CurrentPixel = Diff;
  x           += Diff;
  switch (GUI_GetDrawMode() & (LCD_DRAWMODE_TRANS | LCD_DRAWMODE_XOR)) {
    case 0:
      if (pTrans) {
        do {
          Shift = (3 - CurrentPixel) << 1;
          Index = (Pixels & (0xC0 >> (6 - Shift))) >> Shift;
          PixelIndex = *(pTrans + Index);
          SSD2119_SetPixelIndex(pDevice, x++, y, PixelIndex);
          if (++CurrentPixel == 4) {
            CurrentPixel = 0;
            Pixels = *(++p);
          }
        } while (--xsize);
      } else {
        do {
          Shift = (3 - CurrentPixel) << 1;
          Index = (Pixels & (0xC0 >> (6 - Shift))) >> Shift;
          SSD2119_SetPixelIndex(pDevice, x++, y, Index);
          if (++CurrentPixel == 4) {
            CurrentPixel = 0;
            Pixels = *(++p);
          }
        } while (--xsize);
      }
      break;
    case LCD_DRAWMODE_TRANS:
      if (pTrans) {
        do {
          Shift = (3 - CurrentPixel) << 1;
          Index = (Pixels & (0xC0 >> (6 - Shift))) >> Shift;
          if (Index) {
            PixelIndex = *(pTrans + Index);
            SSD2119_SetPixelIndex(pDevice, x, y, PixelIndex);
          }
          x++;
          if (++CurrentPixel == 4) {
            CurrentPixel = 0;
            Pixels = *(++p);
          }
        } while (--xsize);
      } else {
        do {
          Shift = (3 - CurrentPixel) << 1;
          Index = (Pixels & (0xC0 >> (6 - Shift))) >> Shift;
          if (Index) {
            SSD2119_SetPixelIndex(pDevice, x, y, Index);
          }
          x++;
          if (++CurrentPixel == 4) {
            CurrentPixel = 0;
            Pixels = *(++p);
          }
        } while (--xsize);
      }
      break;
  }
}

/**************************************************************************//**
 * @brief
 *   draw one line of bitmap encoded in 4 bits per pixel
 * @details
 *   This function draws one line of 4BPP encoded bitmap. It is internally used
 *   by drawing entire bitmap routine. Depending on currend drawing mode the
 *   line could be simple setting pixels and background or setting only pixels
 *   with adequate bits set.
 *   Argument pDevice is present for compability with other display drivers.
 *****************************************************************************/
static void  SSD2119_HorizontalLine4bpp(GUI_DEVICE * pDevice, int x, int y, uint8_t const GUI_UNI_PTR * p, int Diff, int xsize, const LCD_PIXELINDEX * pTrans)
{
  LCD_PIXELINDEX Pixels, PixelIndex;
  int CurrentPixel, Shift, Index;
  Pixels       = *p;
  CurrentPixel = Diff;
  x           += Diff;
  switch (GUI_GetDrawMode() & (LCD_DRAWMODE_TRANS | LCD_DRAWMODE_XOR)) {
    case 0:
      if (pTrans) {
        do {
          Shift = (1 - CurrentPixel) << 2;
          Index = (Pixels & (0xF0 >> (4 - Shift))) >> Shift;
          PixelIndex = *(pTrans + Index);
          SSD2119_SetPixelIndex(pDevice, x++, y, PixelIndex);
          if (++CurrentPixel == 2) {
            CurrentPixel = 0;
            Pixels = *(++p);
          }
        } while (--xsize);
      } else {
        do {
          Shift = (1 - CurrentPixel) << 2;
          Index = (Pixels & (0xF0 >> (4 - Shift))) >> Shift;
          SSD2119_SetPixelIndex(pDevice, x++, y, Index);
          if (++CurrentPixel == 2) {
            CurrentPixel = 0;
            Pixels = *(++p);
          }
        } while (--xsize);
      }
      break;
    case LCD_DRAWMODE_TRANS:
      if (pTrans) {
        do {
          Shift = (1 - CurrentPixel) << 2;
          Index = (Pixels & (0xF0 >> (4 - Shift))) >> Shift;
          if (Index) {
            PixelIndex = *(pTrans + Index);
            SSD2119_SetPixelIndex(pDevice, x, y, PixelIndex);
          }
          x++;
          if (++CurrentPixel == 2) {
            CurrentPixel = 0;
            Pixels = *(++p);
          }
        } while (--xsize);
      } else {
        do {
          Shift = (1 - CurrentPixel) << 2;
          Index = (Pixels & (0xF0 >> (4 - Shift))) >> Shift;
          if (Index) {
            SSD2119_SetPixelIndex(pDevice, x, y, Index);
          }
          x++;
          if (++CurrentPixel == 2) {
            CurrentPixel = 0;
            Pixels = *(++p);
          }
        } while (--xsize);
      }
      break;
  }
}

/**************************************************************************//**
 * @brief
 *   draw one line of bitmap encoded in 8 bits per pixel
 * @details
 *   This function draws one line of 8BPP encoded bitmap. It is internally used
 *   by drawing entire bitmap routine. Depending on currend drawing mode the
 *   line could be simple setting pixels and background or setting only pixels
 *   with adequate bits set.
 *   Argument pDevice is present for compability with other display drivers.
 *****************************************************************************/
static void  SSD2119_HorizontalLine8bpp(GUI_DEVICE * pDevice, int x, int y, uint8_t const GUI_UNI_PTR * p, int xsize, const LCD_PIXELINDEX * pTrans)
{
  LCD_PIXELINDEX Pixel;
  uint16_t * pDest;

  if (!pTrans) {
    return; /* No translation from 8bpp BMP to 16bpp device makes no sense */
  }
  SSD2119_SetCurrentPosition((DRIVER_CONTEXT *)pDevice->u.pContext, x, y);
  SSD2119_PrepareDataAccess((DRIVER_CONTEXT *)pDevice->u.pContext);
  switch (GUI_GetDrawMode() & (LCD_DRAWMODE_TRANS | LCD_DRAWMODE_XOR)) {
    case 0:
      while (xsize--) {
        WRITE_DATA((DRIVER_CONTEXT *)pDevice->u.pContext, *(pTrans + *p));
      }
      break;
    case LCD_DRAWMODE_TRANS:
      for (; xsize > 0; xsize--, p++, pDest++) {
        Pixel = *p;
        if (Pixel) {
          WRITE_DATA((DRIVER_CONTEXT *)pDevice->u.pContext, *(pTrans + *p));
        } else {
          uint16_t Index;
          /* we do this just to increment internal pointer */
          Index = READ_DATA((DRIVER_CONTEXT *)pDevice->u.pContext);
          Index = READ_DATA((DRIVER_CONTEXT *)pDevice->u.pContext);
          WRITE_DATA((DRIVER_CONTEXT *)pDevice->u.pContext, Index);
        }
      }
      break;
  }
}

/**************************************************************************//**
 * @brief
 *   draw one line of bitmap encoded in 16 bits per pixel
 * @details
 *   This function draws one line of 16BPP encoded bitmap. It is internally used
 *   by drawing entire bitmap routine.
 *   Argument pDevice is present for compability with other display drivers.
 *****************************************************************************/
static void SSD2119_HorizontalLine16bpp(GUI_DEVICE * pDevice, int x, int y, uint16_t const GUI_UNI_PTR *p, int xsize)
{
  SSD2119_SetCurrentPosition((DRIVER_CONTEXT *)pDevice->u.pContext, x, y);
  SSD2119_PrepareDataAccess((DRIVER_CONTEXT *)pDevice->u.pContext);
  while (xsize--) {
    WRITE_DATA((DRIVER_CONTEXT *)pDevice->u.pContext, *p++);
  }
}

/**************************************************************************//**
 * @brief
 *   draw bitmap
 * @details
 *   This function draws bitmap encoded in one of supported formats.
 *   Argument pDevice is present for compability with other display drivers.
 *****************************************************************************/
static void SSD2119_DrawBitmap(GUI_DEVICE * pDevice, int x0, int y0,
                               int xSize, int ySize,
                               int BitsPerPixel,
                               int BytesPerLine,
                               const uint8_t GUI_UNI_PTR * pData, int Diff,
                               const LCD_PIXELINDEX* pTrans)
{
  int i;

  switch (BitsPerPixel) {
    case 1:
      for (i = 0; i < ySize; i++) {
        SSD2119_HorizontalLine1bpp(pDevice, x0, i + y0, pData, Diff, xSize, pTrans);
        pData += BytesPerLine;
      }
      break;
    case 2:
      for (i = 0; i < ySize; i++) {
        SSD2119_HorizontalLine2bpp(pDevice, x0, i + y0, pData, Diff, xSize, pTrans);
        pData += BytesPerLine;
      }
      break;
    case 4:
      for (i = 0; i < ySize; i++) {
        SSD2119_HorizontalLine4bpp(pDevice, x0, i + y0, pData, Diff, xSize, pTrans);
        pData += BytesPerLine;
      }
      break;
    case 8:
      for (i = 0; i < ySize; i++) {
        SSD2119_HorizontalLine8bpp(pDevice, x0, i + y0, pData, xSize, pTrans);
        pData += BytesPerLine;
      }
      break;
    case 16:
      for (i = 0; i < ySize; i++) {
        SSD2119_HorizontalLine16bpp(pDevice, x0, i + y0, (const uint16_t *)pData, xSize);
        pData += BytesPerLine;
      }
      break;
  }
}

/**************************************************************************//**
 * @brief
 *   Return device property
 * @details
 *   This function returns requested driver or device property
 *****************************************************************************/
static I32 SSD2119_GetDevProp(GUI_DEVICE * pDevice, int Index)
{
  DRIVER_CONTEXT * pContext;

  pContext = (DRIVER_CONTEXT *)pDevice->u.pContext;
  switch (Index) {
    case LCD_DEVCAP_XSIZE:
      return pContext->xSize;
    case LCD_DEVCAP_YSIZE:
      return pContext->ySize;
    case LCD_DEVCAP_VXSIZE:
      return pContext->vxSize;
    case LCD_DEVCAP_VYSIZE:
      return pContext->vySize;
    case LCD_DEVCAP_BITSPERPIXEL:
      return 16;
    case LCD_DEVCAP_NUMCOLORS:
      return 0;
    case LCD_DEVCAP_XMAG:
      return 1;
    case LCD_DEVCAP_YMAG:
      return 1;
    case LCD_DEVCAP_MIRROR_X:
      return 0;
    case LCD_DEVCAP_MIRROR_Y:
      return 0;
    case LCD_DEVCAP_SWAP_XY:
      return 0;
  }
  return -1;
}

/**************************************************************************//**
 * @brief
 *    Return MEMDEV handler
 *****************************************************************************/
static void * SSD2119_GetDevData(GUI_DEVICE * pDevice, int Index)
{
  GUI_USE_PARA(pDevice);
  #if GUI_SUPPORT_MEMDEV
  switch (Index) {
    case LCD_DEVDATA_MEMDEV:
      return (void *)&GUI_MEMDEV_DEVICE_16;
  }
  #else
  GUI_USE_PARA(Index);
  #endif
  return NULL;
}

/***************************************************************************//**
 * @brief
 *   Set LCD controller register and data address
 *
 * @param[in] pDevice- Device driver pointer
 * @param[in] commandAddr - controller registers address
 * @param[in] dataAddr - controller data address
 *
 ******************************************************************************/
static void _SetControllerAddres(GUI_DEVICE * pDevice, uint32_t commandAddr, uint32_t dataAddr)
{
  DRIVER_CONTEXT *context = (DRIVER_CONTEXT *)pDevice->u.pContext;

  context->commandAddr = (uint16_t *)commandAddr;
  context->dataAddr = (uint16_t *)dataAddr;
}

/***************************************************************************//**
 * @brief
 *   Initializes driver context structure
 *
 * @param[in] pDevice
 *   Device driver pointer
 *
 * @return
 *   @li 0 if success
 *   @li 1 when error
 ******************************************************************************/
static int _InitOnce(GUI_DEVICE * pDevice)
{
  DRIVER_CONTEXT *context;
  if (pDevice->u.pContext == NULL) {
    pDevice->u.pContext = GUI_ALLOC_GetFixedBlock(sizeof(DRIVER_CONTEXT));
    context = (DRIVER_CONTEXT *)pDevice->u.pContext;
    if (context) {
      GUI__memset((uint8_t *)pDevice->u.pContext, 0, sizeof(DRIVER_CONTEXT));
#ifdef SSD2119_REGISTER_ACCESS_HOOKS
      context->pfWriteRegister = SSD2119_WriteRegister;
      context->pfReadRegister = SSD2119_ReadRegister;
      context->pfWriteData = SSD2119_WriteData;
      context->pfReadData = SSD2119_ReadData;
#endif
      context->pfInitialize = SSD2119_Initialize;
      current_context = context;
      /* set default controller address, could be overided */
      _SetControllerAddres(pDevice, 0x84000000, 0x84000002);
    }
  }
  return pDevice->u.pContext ? 0 : 1;
}

/**************************************************************************//**
 * @brief
 *   read pixels in defined rectangle
 * @details
 *   This function reads display framebuffer and returns colour of pixels in
 *   defined rectangle.
 *****************************************************************************/
static void SSD2119_ReadRectangle(GUI_DEVICE * pDevice, int x0, int y0, int x1, int y1, LCD_PIXELINDEX * pBuffer)
{
  int x, y;
  uint16_t * p;

  p = (uint16_t*) pBuffer;
  for (y = y0; y <= y1; y++) {
    for (x = x0; x <= x1; x++) {
      *p++ = SSD2119_GetPixelIndex(pDevice, x, y);
    }
  }
}

/**************************************************************************//**
 * @brief
 *   sets video buffer address (kept for compability reason)
 *
 * @param[in] pDevice - Device driver pointer
 * @param[in] pVRAM - pointer to video RAM
 *****************************************************************************/
static void _SetVRAMAddr(GUI_DEVICE * pDevice, void * pVRAM)
{
  DRIVER_CONTEXT * pContext;
  LCD_X_SETVRAMADDR_INFO Data = { 0 };

  _InitOnce(pDevice);
  if (pDevice->u.pContext) {
    pContext = (DRIVER_CONTEXT *)pDevice->u.pContext;
    pContext->VRAMAddr = pContext->BaseAddr = (uint32_t)pVRAM;
    Data.pVRAM = pVRAM;
    LCD_X_DisplayDriver(pDevice->LayerIndex, LCD_X_SETVRAMADDR, (void *)&Data);
  }
  #ifdef WIN32
  SIM_Lin_SetVRAMAddr(pDevice->LayerIndex, pVRAM);
  #endif
}

/*********************************************************************
 *
 *       _SetOrg
 *
 * Purpose:
 *   Calls the driver callback function with the display origin to be set
 */
static void _SetOrg(GUI_DEVICE * pDevice, int x, int y)
{
  #ifndef WIN32
  DRIVER_CONTEXT * pContext;
  int Orientation;
  #endif
  LCD_X_SETORG_INFO Data = { 0, 0 };

  #ifdef WIN32
  LCDSIM_SetOrg(x, y, pDevice->LayerIndex);
  #else
  pContext = (DRIVER_CONTEXT *)pDevice->u.pContext;
  Orientation  = LCD_GetMirrorXEx(pDevice->LayerIndex) * GUI_MIRROR_X;
  Orientation |= LCD_GetMirrorYEx(pDevice->LayerIndex) * GUI_MIRROR_Y;
  Orientation |= LCD_GetSwapXYEx(pDevice->LayerIndex) * GUI_SWAP_XY;
  switch (Orientation) {
    case 0:
      Data.xPos = x;
      Data.yPos = y;
      break;
    case GUI_MIRROR_X:
      Data.xPos = pContext->vxSize - pContext->xSize - x;
      Data.yPos = y;
      break;
    case GUI_MIRROR_Y:
      Data.xPos = x;
      Data.yPos = pContext->vySize - pContext->ySize - y;
      break;
    case GUI_MIRROR_X | GUI_MIRROR_Y:
      Data.xPos = pContext->vxSize - pContext->xSize - x;
      Data.yPos = pContext->vySize - pContext->ySize - y;
      break;
    case GUI_SWAP_XY:
      Data.xPos = y;
      Data.yPos = x;
      break;
    case GUI_SWAP_XY | GUI_MIRROR_X:
      Data.xPos = pContext->vySize - pContext->ySize  - y;
      Data.yPos = x;
      break;
    case GUI_SWAP_XY | GUI_MIRROR_Y:
      Data.xPos = y;
      Data.yPos = pContext->vxSize - pContext->xSize  - x;
      break;
    case GUI_SWAP_XY | GUI_MIRROR_X | GUI_MIRROR_Y:
      Data.xPos = pContext->vySize - pContext->ySize  - y;
      Data.yPos = pContext->vxSize - pContext->xSize  - x;
      break;
  }
  LCD_X_DisplayDriver(pDevice->LayerIndex, LCD_X_SETORG, (void *)&Data);
  #endif
}

/*********************************************************************
 *
 *       _GetRect
 *
 * Purpose:
 *   Returns the display size.
 */
static void _GetRect(GUI_DEVICE * pDevice, LCD_RECT * pRect)
{
  DRIVER_CONTEXT * pContext;

  pContext = (DRIVER_CONTEXT *)pDevice->u.pContext;
  pRect->x0 = 0;
  pRect->y0 = 0;
  pRect->x1 = pContext->vxSize - 1;
  pRect->y1 = pContext->vySize - 1;
}

/*********************************************************************
 *
 *       _SetVSize
 */
static void _SetVSize(GUI_DEVICE * pDevice, int xSize, int ySize)
{
  DRIVER_CONTEXT * pContext;
  #ifdef WIN32
  int NumBuffers;
  #endif

  _InitOnce(pDevice);
  if (pDevice->u.pContext) {
    #ifdef WIN32
    NumBuffers = GUI_MULTIBUF_GetNumBuffers();
    #endif
    pContext = (DRIVER_CONTEXT *)pDevice->u.pContext;
    if (LCD_GetSwapXYEx(pDevice->LayerIndex)) {
      #ifdef WIN32
      pContext->vxSize = xSize * NumBuffers;
      #else
      pContext->vxSize = xSize;
      #endif
      pContext->vySize = ySize;
      pContext->vxSizePhys = ySize;
    } else {
      pContext->vxSize = xSize;
      #ifdef WIN32
      pContext->vySize = ySize * NumBuffers;
      #else
      pContext->vySize = ySize;
      #endif
      pContext->vxSizePhys = xSize;
    }
  }
  #ifdef WIN32
  SIM_Lin_SetVRAMSize(pDevice->LayerIndex, pContext->vxSize, pContext->vySize, pContext->xSize, pContext->ySize);
  #endif
}

/*********************************************************************
 *
 *       _SetSize
 */
static void _SetSize(GUI_DEVICE * pDevice, int xSize, int ySize)
{
  DRIVER_CONTEXT * pContext;
  LCD_X_SETSIZE_INFO Data = { 0, 0 };

