espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/kit/common/drivers/emwin/DK3550/ssd2119.c
  _InitOnce(pDevice);
  if (pDevice->u.pContext) {
    pContext = (DRIVER_CONTEXT *)pDevice->u.pContext;
    if (pContext->vxSizePhys == 0) {
      if (LCD_GetSwapXYEx(pDevice->LayerIndex)) {
        pContext->vxSizePhys = ySize;
      } else {
        pContext->vxSizePhys = xSize;
      }
    }
    pContext->xSize = xSize;
    pContext->ySize = ySize;
    Data.xSize = xSize;
    Data.ySize = ySize;
    LCD_X_DisplayDriver(pDevice->LayerIndex, LCD_X_SETSIZE, (void *)&Data);
  }
}

/*********************************************************************
 *
 *       _SetPos
 *
 * Purpose:
 *   Sets the position of the given layer by sending a LCD_X_SETPOS command to LCD_X_DisplayDriver()
 *   (Requires special hardware support.)
 */
static void _SetPos(GUI_DEVICE * pDevice, int xPos, int yPos)
{
  DRIVER_CONTEXT * pContext;
  LCD_X_SETPOS_INFO Data = { 0 };

  _InitOnce(pDevice);
  if (pDevice->u.pContext) {
    pContext = (DRIVER_CONTEXT *)pDevice->u.pContext;
    pContext->xPos = xPos;
    pContext->yPos = yPos;
    Data.xPos = xPos;
    Data.yPos = yPos;
    LCD_X_DisplayDriver(pDevice->LayerIndex, LCD_X_SETPOS, (void *)&Data);
  }
}

/*********************************************************************
 *
 *       _GetPos
 *
 * Purpose:
 *   Returns the position of the given layer.
 */
static void _GetPos(GUI_DEVICE * pDevice, int * pxPos, int * pyPos)
{
  DRIVER_CONTEXT * pContext;

  _InitOnce(pDevice);
  if (pDevice->u.pContext) {
    pContext = (DRIVER_CONTEXT *)pDevice->u.pContext;
    *pxPos = pContext->xPos;
    *pyPos = pContext->yPos;
  }
}

/*********************************************************************
 *
 *       _SetAlpha
 *
 * Purpose:
 *   Sets the alpha value of the given layer by sending a LCD_X_SETALPHA command to LCD_X_DisplayDriver()
 *   (Requires special hardware support.)
 */
static void _SetAlpha(GUI_DEVICE * pDevice, int Alpha)
{
  DRIVER_CONTEXT * pContext;
  LCD_X_SETALPHA_INFO Data = { 0 };

  _InitOnce(pDevice);
  if (pDevice->u.pContext) {
    pContext = (DRIVER_CONTEXT *)pDevice->u.pContext;
    pContext->Alpha = Alpha;
    Data.Alpha = Alpha;
    LCD_X_DisplayDriver(pDevice->LayerIndex, LCD_X_SETALPHA, (void *)&Data);
  }
}

/*********************************************************************
 *
 *       _SetVis
 *
 * Purpose:
 *   Sets the visibility of the given layer by sending a LCD_X_SETVIS command to LCD_X_DisplayDriver()
 *   (Requires special hardware support.)
 */
static void _SetVis(GUI_DEVICE * pDevice, int OnOff)
{
  DRIVER_CONTEXT * pContext;
  LCD_X_SETVIS_INFO Data = { 0 };

  _InitOnce(pDevice);
  if (pDevice->u.pContext) {
    pContext = (DRIVER_CONTEXT *)pDevice->u.pContext;
    pContext->IsVisible = OnOff;
    Data.OnOff = OnOff;
    LCD_X_DisplayDriver(pDevice->LayerIndex, LCD_X_SETVIS, (void *)&Data);
  }
}

/*********************************************************************
 *
 *       _Init
 *
 * Purpose:
 *   Called during the initialization process of emWin.
 */
static int  _Init(GUI_DEVICE * pDevice)
{
  int r;
  DRIVER_CONTEXT *pContext = (DRIVER_CONTEXT *)pDevice->u.pContext;

  r = _InitOnce(pDevice);
  r |= LCD_X_DisplayDriver(pDevice->LayerIndex, LCD_X_INITCONTROLLER, NULL);
  if (pContext->pfInitialize) {
    pContext->pfInitialize(pDevice);
  }
  return r;
}

/*********************************************************************
 *
 *       _On
 *
 * Purpose:
 *   Sends a LCD_X_ON command to LCD_X_DisplayDriver().
 */
static void _On(GUI_DEVICE * pDevice)
{
  LCD_X_DisplayDriver(pDevice->LayerIndex, LCD_X_ON, NULL);
}

/*********************************************************************
 *
 *       _Off
 *
 * Purpose:
 *   Sends a LCD_X_OFF command to LCD_X_DisplayDriver().
 */
static void _Off(GUI_DEVICE * pDevice)
{
  LCD_X_DisplayDriver(pDevice->LayerIndex, LCD_X_OFF, NULL);
}

/*********************************************************************
 *
 *       _SetAlphaMode
 *
 * Purpose:
 *   Sets the alpha mode of the given layer by sending a LCD_X_SETALPHAMODE command to LCD_X_DisplayDriver()
 *   (Requires special hardware support.)
 */
static void _SetAlphaMode(GUI_DEVICE * pDevice, int AlphaMode)
{
  LCD_X_SETALPHAMODE_INFO Data = { 0 };

  Data.AlphaMode = AlphaMode;
  LCD_X_DisplayDriver(pDevice->LayerIndex, LCD_X_SETALPHAMODE, (void *)&Data);
}

/*********************************************************************
 *
 *       _SetChromaMode
 *
 * Purpose:
 *   Sets the chroma mode of the given layer by sending a LCD_X_SETCHROMAMODE command to LCD_X_DisplayDriver()
 *   (Requires special hardware support.)
 */
static void _SetChromaMode(GUI_DEVICE * pDevice, int ChromaMode)
{
  LCD_X_SETCHROMAMODE_INFO Data = { 0 };

  Data.ChromaMode = ChromaMode;
  LCD_X_DisplayDriver(pDevice->LayerIndex, LCD_X_SETCHROMAMODE, (void *)&Data);
}

/*********************************************************************
 *
 *       _SetChroma
 *
 * Purpose:
 *   Sets the chroma values of the given layer by sending a LCD_X_SETCHROMA command to LCD_X_DisplayDriver()
 *   (Requires special hardware support.)
 */
static void _SetChroma(GUI_DEVICE * pDevice, LCD_COLOR ChromaMin, LCD_COLOR ChromaMax)
{
  LCD_X_SETCHROMA_INFO Data = { 0, 0 };

  Data.ChromaMin = ChromaMin;
  Data.ChromaMax = ChromaMax;
  LCD_X_DisplayDriver(pDevice->LayerIndex, LCD_X_SETCHROMA, (void *)&Data);
}

/*********************************************************************
 *
 *       _CopyBuffer
 *
 * Purpose:
 *   Copies the source buffer to the destination buffer and routes
 *   further drawing operations to the destination buffer.
 *
 *   (Required for using multiple buffers)
 */
static void _CopyBuffer(GUI_DEVICE * pDevice, int IndexSrc, int IndexDst)
{
  DRIVER_CONTEXT * pContext;
  #ifndef WIN32
  uint32_t AddrSrc, AddrDst;
  I32 BufferSize;
  int BitsPerPixel;
  #endif

  _InitOnce(pDevice);
  if (pDevice->u.pContext) {
    pContext = (DRIVER_CONTEXT *)pDevice->u.pContext;
    if (IndexSrc != IndexDst) {
      #ifdef WIN32
      SIM_Lin_CopyBuffer(IndexSrc, IndexDst);
      #else
      BitsPerPixel = pDevice->pDeviceAPI->pfGetDevProp(pDevice, LCD_DEVCAP_BITSPERPIXEL);
      BufferSize = (((uint32_t)pContext->xSize * pContext->ySize * BitsPerPixel) >> 3);
      AddrSrc = pContext->BaseAddr + BufferSize * IndexSrc;
      AddrDst = pContext->BaseAddr + BufferSize * IndexDst;
      if (pContext->pfCopyBuffer) {
        //
        // Use custom callback function for copy operation
        //
        pContext->pfCopyBuffer(pDevice->LayerIndex, IndexSrc, IndexDst);
      } else {
        //
        // Calculate pointers for copy operation
        //
        GUI_MEMCPY((void *)AddrDst, (void *)AddrSrc, BufferSize);
      }
      //
      // Set destination buffer as target for further drawing operations
      //
      pContext->VRAMAddr = AddrDst;
      #endif
    }
  }
}

/*********************************************************************
 *
 *       _ShowBuffer
 *
 * Purpose:
 *   Sends a LCD_X_SHOWBUFFER command to LCD_X_DisplayDriver() to make the given buffer visible.
 *
 *   (Required for using multiple buffers)
 */
static void _ShowBuffer(GUI_DEVICE * pDevice, int Index)
{
  LCD_X_SHOWBUFFER_INFO Data = { 0 };

  _InitOnce(pDevice);
  if (pDevice->u.pContext) {
    #ifdef WIN32
    SIM_Lin_ShowBuffer(Index);
    #else
    Data.Index = Index;
    LCD_X_DisplayDriver(pDevice->LayerIndex, LCD_X_SHOWBUFFER, (void *)&Data);
    #endif
  }
}

/*********************************************************************
 *
 *       _SetFunc
 *
 * Purpose:
 *   Setting of function pointers.
 */
static void _SetFunc(GUI_DEVICE * pDevice, int Index, void (* pFunc)(void))
{
  DRIVER_CONTEXT * pContext;

  _InitOnce(pDevice);
  if (pDevice->u.pContext) {
    pContext = (DRIVER_CONTEXT *)pDevice->u.pContext;
    switch (Index) {
      case LCD_DEVFUNC_COPYBUFFER:
        pContext->pfCopyBuffer = (void (*)(int LayerIndex, int IndexSrc, int IndexDst))pFunc;
        break;
      case LCD_DEVFUNC_FILLRECT:
        pContext->pfFillRect   = (void (*)(int LayerIndex, int x0, int y0, int x1, int y1, uint32_t PixelIndex))pFunc;
        break;
      case LCD_DEVFUNC_DRAWBMP_1BPP:
        pContext->pfDrawBMP1   = (void (*)(int LayerIndex, int x, int y, uint8_t const * p, int Diff, int xSize, int ySize, int BytesPerLine, const LCD_PIXELINDEX * pTrans))pFunc;
        break;
      case LCD_DEVFUNC_COPYRECT:
        pContext->pfCopyRect   = (void (*)(int LayerIndex, int x0, int y0, int x1, int y1, int xSize, int ySize))pFunc;
        break;
#ifdef SSD2119_REGISTER_ACCESS_HOOKS
      case LCD_DEVFUNC_WRITEREGISTER:
        pContext->pfWriteRegister   =  (void (*)(uint16_t reg))pFunc;
        break;
      case LCD_DEVFUNC_READREGISTER:
        pContext->pfReadRegister   =  (uint16_t (*)(uint16_t reg))pFunc;
        break;
      case LCD_DEVFUNC_WRITEDATA:
        pContext->pfWriteData   =  (void (*)(uint16_t value))pFunc;
        break;
      case LCD_DEVFUNC_READDATA:
        pContext->pfReadData   =  (uint16_t (*)(void))pFunc;
#endif
      case LCD_DEVFUNC_INITIALIZE:
        pContext->pfInitialize = (void (*)(GUI_DEVICE *))pFunc;
        break;
    }
  }
}

/**************************************************************************//**
 * @brief
 *   return defined function handler
 * @details
 *   Specified function handler is returned
 *****************************************************************************/
static void(*SSD2119_GetDevFunc(GUI_DEVICE ** ppDevice, int Index))(void) {
  GUI_USE_PARA(ppDevice);
  switch (Index) {
    case LCD_DEVFUNC_SET_VRAM_ADDR:
      return (void (*)(void))_SetVRAMAddr;
    case LCD_DEVFUNC_SET_VSIZE:
      return (void (*)(void))_SetVSize;
    case LCD_DEVFUNC_SET_SIZE:
      return (void (*)(void))_SetSize;
    case LCD_DEVFUNC_SETPOS:
      return (void (*)(void))_SetPos;
    case LCD_DEVFUNC_GETPOS:
      return (void (*)(void))_GetPos;
    case LCD_DEVFUNC_SETALPHA:
      return (void (*)(void))_SetAlpha;
    case LCD_DEVFUNC_SETVIS:
      return (void (*)(void))_SetVis;
    case LCD_DEVFUNC_INIT:
      return (void (*)(void))_Init;
    case LCD_DEVFUNC_ON:
      return (void (*)(void))_On;
    case LCD_DEVFUNC_OFF:
      return (void (*)(void))_Off;
    case LCD_DEVFUNC_ALPHAMODE:
      return (void (*)(void))_SetAlphaMode;
    case LCD_DEVFUNC_CHROMAMODE:
      return (void (*)(void))_SetChromaMode;
    case LCD_DEVFUNC_CHROMA:
      return (void (*)(void))_SetChroma;
    case LCD_DEVFUNC_COPYBUFFER:
      return (void (*)(void))_CopyBuffer;
    case LCD_DEVFUNC_SHOWBUFFER:
      return (void (*)(void))_ShowBuffer;
    case LCD_DEVFUNC_SETFUNC:
      return (void (*)(void))_SetFunc;
    case LCD_DEVFUNC_COPYRECT:
      return (void (*)(void))((DRIVER_CONTEXT *)(*ppDevice)->u.pContext)->pfCopyRect;
    case LCD_DEVFUNC_READRECT:
      return (void (*)(void))SSD2119_ReadRectangle;
    case LCD_DEVFUNC_CONTRADDR:
      return (void (*)(void))_SetControllerAddres;
  }
  return (void (*)(void))NULL;
}

/*********************************************************************
 *
 *       Public data
 *
 **********************************************************************
 */
/*********************************************************************
 *
 *       GUI_DEVICE_API structure
 */
const GUI_DEVICE_API GUIDRV_SSD2119 =
{
  DEVICE_CLASS_DRIVER,
  SSD2119_DrawBitmap,
  SSD2119_DrawHLine,
  SSD2119_DrawVLine,
  SSD2119_FillRect,
  SSD2119_GetPixelIndex,
  SSD2119_SetPixelIndex,
  SSD2119_XorPixel,
  _SetOrg,
  SSD2119_GetDevFunc,
  SSD2119_GetDevProp,
  SSD2119_GetDevData,
  _GetRect,
};

#else

void GUIDRV_SSD2119(void);   // Avoid empty object files
void GUIDRV_SSD2119(void)
{
}

#endif

/** @endcond */

/*************************** End of file ****************************/
